Revit 2027 API
PathReinforcement.PathReinforcementType Property
 Retrieves the type of the Path Reinforcement.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PathReinforcementType PathReinforcementType { get; }
Public ReadOnly Property PathReinforcementType As PathReinforcementType
	Get
public:
property PathReinforcementType^ PathReinforcementType {
	PathReinforcementType^ get ();
}
member PathReinforcementType : PathReinforcementType with get
Property Value
PathReinforcementType
See Also
Reference
PathReinforcement Class
Autodesk.Revit.DB.Structure Namespace